{
  "testimonials": [
    {
      "username": "MaryJoy",
      "title": "Tutor Praise: Data Wisdom",
      "explanation": "I would like to express my sincere appreciation to the exceptional tutors at Datafied Academy for imparting invaluable knowledge in the field of Data Analytics. The learning experience has been enlightening for both myself and my fellow learners, and your efforts are truly commendable.",
      "rating": 4.5
    },
    {
      "username": "Steve",
      "title": "Data Journey: Novice to Pro with Excel, Power BI",
      "explanation": "The journey in the field of Data Analytics has been truly remarkable, starting from a complete novice to delving deep into Excel and Power BI, performing calculations, and crafting impactful visuals and dashboards. Datafied Academy has proven to be an outstanding institution thus far, and I eagerly anticipate further knowledge acquisition and growth. Applauding the Academy's excellence!",
      "rating": 4.5
    },
    {
      "username": "Amanda",
      "title": "Datafied Academy: Meeting Expectations, Enjoying the Journey",
      "explanation": "Thus far, my experience with Datafied Academy has lived up to my expectations. To be completely honest, I have derived immense enjoyment from every step of the data cleaning process, and despite occasional challenges, there is a sense of fulfilment that accompanies the completion of each task. The Academy's assistance in streamlining each stage and their prompt resolution of any encountered issues has been highly satisfying.",
      "rating": 5
    },
    {
      "username": "Msendoo",
      "title": "Fulfilling Journey at Datafied Academy",
      "explanation": "My journey at Datafied Academy has been extremely fulfilling as I immersed myself in the realm of Excel and Power BI. Right from the start, the courses have offered a comprehensive and well-organized approach to mastering these influential data analysis tools. The interactive nature of the courses, including quizzes and assignments, has allowed me to put my knowledge into practice and reinforce my understanding. I would like to express my utmost appreciation to my instructors for their humility and wholehearted dedication. It is truly admirable. To my fellow Titans, I am honored to be associated with such brilliant minds. I eagerly anticipate collaborating and working together, tackling complex datasets, and uncovering valuable insights.",
      "rating": 5
    },
    {
      "username": "Pelumi",
      "title": "Persistence Pays Off: Data Analytics Success on the Fifth Attempt with Datafied Academy",
      "explanation": "So I have tried learning Data Analytics FOUR TIMES and to be honest a combination of my lack of dedication and the difficulty in getting hands-on learning experience was a reason I had that high number of trials. But you know what the Bible says about the righteous and seven times, yeah? This is my fifth attempt and I can say that it's my best too. One thing that stands out for me with Datafied is that HANDS-ON EXPERIENCE. I'm miles away and calling Clara at 3/4 am her time and she's available. Thank you, guys. This was money well spent!",
      "rating": 5,
      "pictureAdjust": "top"
    },
    {
      "username": "Koketso",
      "title": "Exceptional Data Analytics Journey: Excel, Power BI, and Beyond at Datafied Academy",
      "explanation": "At Datafied Academy, my data analytics journey has been exceptional. I've learned advanced Excel techniques, empowering me to manipulate and analyze data effectively. Power BI introduced me to data visualization, creating interactive dashboards for insightful presentations. Now, I'm excited to dive into SQL and master database management. The practical approach, support from instructors, and collaboration with peers have made learning enjoyable. Beyond technical skills, the emphasis on critical thinking and problem-solving prepares me for real-world data challenges. I'm confident that these skills will pave the way for a successful career in data analytics.",
      "rating": 5
    },
    {
      "username": "Lydia",
      "title": "Transformative Data Analytics Journey: From Zero to Proficiency with Datafied Tutors",
      "explanation": "I am having an amazing experience in the field of Data Analytics, starting from zero tech knowledge and becoming proficient in Excel, Power BI, calculating measures, and creating visuals and dashboards. The tutors, namely Clara, Nnamdi, Bariyat, and Praise, are playing a crucial role in my learning journey. I am grateful for the tutors' support, availability, and impactful teaching. I highly recommend Datafied as a platform for learning Data Analytics for everyone. Overall, the experience is transformative and rewarding.",
      "rating": 5,
      "pictureAdjust": "left-top"
    },
    {
      "username": "Esther",
      "title": "Privileged Learning Journey: Energy, Zeal, and Passion with Datafied",
      "explanation": "Connecting with Datafied has been a privilege, yeah! It paves the way and ensures that all aspirant Titans who aspire to become professionals in their respective disciplines have a solid foundation. I can't quantify the energy, zeal, and passion the facilitators put into making sure everyone is carried along without leaving anyone behind. The beautiful aspect is having access to call our facilitators when stuck while learning on your own or practicing. It is what makes the money you paid unquantifiable. Learning is continuous for me; it has been a journey of mixed feelings, though I gladly embrace it with an atmosphere of learning for myself. I can't wait to become a Pro in SQL!",
      "rating": 5,
      "pictureAdjust": "right"
    },
    {
      "username": "Joshua",
      "title": "Exceptional Professionalism at Datafied Academy",
      "explanation": "For anyone interested in mastering data analytics, there's no better destination than DATAFIED ACADEMY. Their tutors exhibit exceptional professionalism and humility, going above and beyond to ensure your learning experience is Top-notch. A heartfelt thank you to DATAFIED ACADEMY for their invaluable contributions!",
      "rating": 5
    },
    {
      "username": "Chinenye",
      "title": "Transformative Learning at Datafied",
      "explanation": "My journey into the world of data analysis began about two years ago and having enrolled for the program with two different academies at different times, I gave up each time. I struggled to grasp the concepts and actually thought I was unteachable. Alas, I realized the problem when I joined Datafied. I wasn't unteachable. The problem was the teaching methods used in other programs. With Datafied, concepts are simplified and teachers are ALWAYS available. If you think you have a coconut head, come to Datafied. Our facilitators are patient and they go above and beyond to ensure that students are reached at whatever level they are. With three weekly sessions and constant follow up, they make learning easy and relatable. I have no regrets being with them and I am always eager to recommend them to anyone who cares to know",
      "rating": 5,
      "pictureAdjust": "left"
    },
    {
      "username": "Ezekiel",
      "title": "Incredible Learning Journey",
      "explanation": "It has been an incredible learning experience with Datafied Academy. This program has been nothing short of transformative for me.  One thing that Datafied Academy provided for me was a proper roadmap to learning data analytics. The roadmap was comprehensive and well-structured, offering a clear path through the complexities of data analytics. The modules were thoughtfully organised, and the learning materials were not only informative but also engaging. Another thing that stood out for me was the discipline instilled throughout the course. The structured nature of the program helped me stay focused and motivated. The regular assessments, interactive sessions, and assignments contributed to a disciplined learning environment, ensuring that I stayed on track and met the learning objectives. The instructors were not only knowledgeable but also approachable. Their guidance and prompt feedback were invaluable, making the learning journey more enriching. Also, the support from my coursemates (Data Heroes) created a positive and collaborative learning atmosphere. Overall, I feel equipped with a deeper understanding of data analytics, thanks to Datafied Academy. The skills and knowledge acquired during the course are crucial for my professional growth. I look forward to staying connected with the Datafied Academy’s community and exploring further learning opportunities.",
      "rating": 5
    }
  ]
}
